## Demostración de Pandas

In [6]:
lista = [0,1,2,3,4,5,6,7]

In [2]:
print(lista)

[0, 1, 2, 3, 4, 5, 6, 7]

In [3]:
[number + 1 for number in lista]

[1, 2, 3, 4, 5, 6, 7, 8]

In [4]:
lista2 = ["Save", "The", "Pandas"]

In [5]:
for cadena in enumerate(lista2):
    print cadena

(0, 'Save')
(1, 'The')
(2, 'Pandas')

### Diccionarios

In [7]:
dic = {"hello":1, 1:"hi"}

In [8]:
dic["hello"]

1

In [9]:
dic[1]

'hi'

Un for con diccionarios me trae las llaves.

In [10]:
for key in dic:
    print dic[key]

hi
1

## Biblioteca de Numpy

In [11]:
import numpy as np

In [15]:
array1 = np.array([1,2,3,4,5])

In [16]:
type(array1)

numpy.ndarray

In [17]:
array1 + 1

array([2, 3, 4, 5, 6])

In [18]:
array2 = array1

In [19]:
array1 + array2

array([ 2,  4,  6,  8, 10])

In [20]:
%time print"Hello"

Hello
CPU times: user 19 µs, sys: 8 µs, total: 27 µs
Wall time: 29.1 µs

In [22]:
listamillon = range(0,1000000)

In [24]:
%time mylista = [number + 1 for number in listamillon]

CPU times: user 101 ms, sys: 42.7 ms, total: 143 ms
Wall time: 145 ms

In [26]:
arraymillon = np.arange(1000000)

In [27]:
%time arraymillon2 = arraymillon+1

CPU times: user 2.25 ms, sys: 1.18 ms, total: 3.43 ms
Wall time: 3.35 ms

### Librería de PANDAS
### Series

In [28]:
import pandas as pd

In [29]:
# para no poner pd todo el tiempo
from pandas import Series

In [30]:
serie1 = Series(lista2)

In [31]:
serie1

0      Save
1       The
2    Pandas
dtype: object

In [32]:
# usando indices propios
serie2 = Series(lista2, index=[5,6,7])

In [34]:
serie2

5      Save
6       The
7    Pandas
dtype: object

In [35]:
serie2.index

Int64Index([5, 6, 7], dtype='int64')

In [36]:
serie2.index.values

array([5, 6, 7])

In [38]:
serie2.index.values

array([5, 6, 7])

In [39]:
serie3 = Series(lista2, index=["element1", "element2", "element3"])

In [41]:
serie3

element1      Save
element2       The
element3    Pandas
dtype: object

In [44]:
lista3 = [1,3,5,7,9,11,13,15]

In [45]:
lista3

[1, 3, 5, 7, 9, 11, 13, 15]

In [46]:
serie4 = Series(lista3)

In [47]:
serie4

0     1
1     3
2     5
3     7
4     9
5    11
6    13
7    15
dtype: int64

In [48]:
serie4 + serie4

0     2
1     6
2    10
3    14
4    18
5    22
6    26
7    30
dtype: int64

In [49]:
serie5 = Series(lista3, index=[1,2,3,4,5,6,7,8])

In [51]:
# la suma se hace no por orden de posición, sino por el nº de indice.
serie4 + serie5

0   NaN
1     4
2     8
3    12
4    16
5    20
6    24
7    28
8   NaN
dtype: float64

### DataFrames

In [53]:
from pandas import DataFrame

In [54]:
# En pandas, primero se da la columna y luego en índice. Al contrario de R

In [55]:
serie6 = 2*serie4

In [62]:
# Rellena por filas
dataframe1 = DataFrame([serie4, serie6])

In [63]:
dataframe1

   0  1   2   3   4   5   6   7
0  1  3   5   7   9  11  13  15
1  2  6  10  14  18  22  26  30

In [64]:
# Rellena por columnas
dataframe2 = DataFrame({'col1':serie4, 'col2':serie6})

In [66]:
dataframe2

   col1  col2
0     1     2
1     3     6
2     5    10
3     7    14
4     9    18
5    11    22
6    13    26
7    15    30

In [67]:
dataframe2.columns

Index([u'col1', u'col2'], dtype='object')

In [68]:
dataframe2.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7], dtype='int64')

In [71]:
# devuelve una de las series o columna.
dataframe2['col1']

0     1
1     3
2     5
3     7
4     9
5    11
6    13
7    15
Name: col1, dtype: int64

In [73]:
dataframe3 = DataFrame({'col1':[1,2,3], 'col2':["Save", "The", "Pandas"]})

In [74]:
dataframe3

   col1    col2
0     1    Save
1     2     The
2     3  Pandas

In [75]:
dataframe3["col2"]

0      Save
1       The
2    Pandas
Name: col2, dtype: object

In [76]:
dataframe3["col2"][0]

'Save'

In [79]:
# se puede crear una columnas nueva con un valor fijo.
dataframe2['col3'] = 1

In [80]:
dataframe2

   col1  col2  col3
0     1     2     1
1     3     6     1
2     5    10     1
3     7    14     1
4     9    18     1
5    11    22     1
6    13    26     1
7    15    30     1

In [81]:
dataframe2['col3'] = np.arange(8)

In [82]:
dataframe2

   col1  col2  col3
0     1     2     0
1     3     6     1
2     5    10     2
3     7    14     3
4     9    18     4
5    11    22     5
6    13    26     6
7    15    30     7

In [84]:
dataframe3 = DataFrame([1,2,3,np.nan])

In [85]:
dataframe3

    0
0   1
1   2
2   3
3 NaN

In [87]:
# Para quitar los NaN eliminando TODA la línea.
dataframe3.dropna()

   0
0  1
1  2
2  3

In [89]:
# Para trasponer una columna.
dataframe3.T

   0  1  2   3
0  1  2  3 NaN

In [90]:
dataframe3.T.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [91]:
# Modificar una celda.
dataframe3[0][2] = 6

In [92]:
dataframe3

    0
0   1
1   2
2   6
3 NaN

In [93]:
indice = dataframe2.index

In [94]:
indice

Int64Index([0, 1, 2, 3, 4, 5, 6, 7], dtype='int64')

In [95]:
indice.values

array([0, 1, 2, 3, 4, 5, 6, 7])

In [96]:
# un valor está dentro de un índice.
2 in indice

True

In [97]:
20 in dataframe2.index

False

In [98]:
dataframe2.columns

Index([u'col1', u'col2', u'col3'], dtype='object')

In [100]:
dataframe2.columns = ['Columna1', 'Columna2','Columna3']

In [101]:
dataframe2

   Columna1  Columna2  Columna3
0         1         2         0
1         3         6         1
2         5        10         2
3         7        14         3
4         9        18         4
5        11        22         5
6        13        26         6
7        15        30         7

In [104]:
# Uso de reindex
dataframe2.reindex(columns=['Columna1', 'c2','c3'])

   Columna1  c2  c3
0         1 NaN NaN
1         3 NaN NaN
2         5 NaN NaN
3         7 NaN NaN
4         9 NaN NaN
5        11 NaN NaN
6        13 NaN NaN
7        15 NaN NaN

In [105]:
# Se puede usar reindex para el índice quitando columns arriba.

In [107]:
# Añadir más filas.
pd.concat([dataframe2, dataframe2])

   Columna1  Columna2  Columna3
0         1         2         0
1         3         6         1
2         5        10         2
3         7        14         3
4         9        18         4
5        11        22         5
6        13        26         6
7        15        30         7
0         1         2         0
1         3         6         1
2         5        10         2
3         7        14         3
4         9        18         4
5        11        22         5
6        13        26         6
7        15        30         7

In [108]:
dataframeconvacios = dataframe2.reindex(columns=['Columna1', 'c2', 'c3'])

In [109]:
dataframeconvacios

   Columna1  c2  c3
0         1 NaN NaN
1         3 NaN NaN
2         5 NaN NaN
3         7 NaN NaN
4         9 NaN NaN
5        11 NaN NaN
6        13 NaN NaN
7        15 NaN NaN

In [110]:
dataframeconvacios.dropna()

Empty DataFrame
Columns: [Columna1, c2, c3]
Index: []

In [112]:
# Para añadir con los valores que queramos.
dataframeconvacios.fillna(1)

   Columna1  c2  c3
0         1   1   1
1         3   1   1
2         5   1   1
3         7   1   1
4         9   1   1
5        11   1   1
6        13   1   1
7        15   1   1

### Acceso a los datos en Pandas

In [113]:
dataframe2['Columna1'][1]

3

In [116]:
# Una fila como una serie.
dataframe2.ix[1]

Columna1    3
Columna2    6
Columna3    1
Name: 1, dtype: int64

In [118]:
dataframe2.ix[1]['Columna1']

3

In [120]:
dataframe2.ix[1]

Columna1    3
Columna2    6
Columna3    1
Name: 1, dtype: int64

In [121]:
serie1 = dataframe2['Columna2']

In [122]:
serie1

0     2
1     6
2    10
3    14
4    18
5    22
6    26
7    30
Name: Columna2, dtype: int64

In [123]:
serie1 > 10

0    False
1    False
2    False
3     True
4     True
5     True
6     True
7     True
Name: Columna2, dtype: bool

In [124]:
dataframe2['Columna2'] > 10

0    False
1    False
2    False
3     True
4     True
5     True
6     True
7     True
Name: Columna2, dtype: bool

In [126]:
# Selección de valores por una condición
dataframe2[dataframe2['Columna2'] > 10]

   Columna1  Columna2  Columna3
3         7        14         3
4         9        18         4
5        11        22         5
6        13        26         6
7        15        30         7

In [128]:
# Uso de operadores de comparación
# Devolución de una parte del dataframe según una condición.

dataframe2[(dataframe2['Columna2'] > 10) & (dataframe2['Columna3'] > 5)]

   Columna1  Columna2  Columna3
6        13        26         6
7        15        30         7

In [129]:
mydata = dataframe2[(dataframe2['Columna2'] > 10) & (dataframe2['Columna3'] > 5)]

In [131]:
type(mydata)

pandas.core.frame.DataFrame

In [132]:
# Aplicar una función a todos los valores de un dataframe

def suma(val):
    return val+1
dataframe2.applymap(suma)

   Columna1  Columna2  Columna3
0         2         3         1
1         4         7         2
2         6        11         3
3         8        15         4
4        10        19         5
5        12        23         6
6        14        27         7
7        16        31         8

In [133]:
# Funciones lambda, crear funciones de UNA sola línea.

dataframe2.applymap(lambda element: element + 1)

   Columna1  Columna2  Columna3
0         2         3         1
1         4         7         2
2         6        11         3
3         8        15         4
4        10        19         5
5        12        23         6
6        14        27         7
7        16        31         8

In [134]:
dataframe2.applymap(lambda element: (element * 2) + 1)

   Columna1  Columna2  Columna3
0         3         5         1
1         7        13         3
2        11        21         5
3        15        29         7
4        19        37         9
5        23        45        11
6        27        53        13
7        31        61        15

In [136]:
# Aplicar la función solo a elementos de una fila o columna.

dataframe2.apply(lambda serie: 1)

Columna1    1
Columna2    1
Columna3    1
dtype: int64

In [138]:
# Trabaja en vez de con cada elemento, con cada serie (columna)

dataframe2.apply(lambda serie: serie.max())

Columna1    15
Columna2    30
Columna3     7
dtype: int64

In [139]:
# Con axis puedes cambiar de columnas a filas.

dataframe2.apply(lambda serie: serie.max(), axis=1)

0     2
1     6
2    10
3    14
4    18
5    22
6    26
7    30
dtype: int64

In [141]:
# Devuelve varios a la vez por columns

dataframe2.apply(lambda serie: Series([serie.min(), serie.max()]))

   Columna1  Columna2  Columna3
0         1         2         0
1        15        30         7

In [142]:
# ahora por rows

dataframe2.apply(lambda serie: Series([serie.min(), serie.max()]), axis=1)

   0   1
0  0   2
1  1   6
2  2  10
3  3  14
4  4  18
5  5  22
6  6  26
7  7  30

## Loading and saving data

In [143]:
!ls -l /home/dsc/Data/opentraveldata/optd_aircraft.csv

-rw-r--r--. 1 dsc dsc 18612 Nov  8 14:10 /home/dsc/Data/opentraveldata/optd_aircraft.csv

In [144]:
# carga de fichero. Mirar con htop la memoria.

aircraftdf = pd.read_csv("/home/dsc/Data/opentraveldata/optd_aircraft.csv", sep="^")

In [146]:
aircraftdf.head(10)

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
0,100,Fokker,100,100,2J,F100,2,J
1,141,BAe,146-100,146,4J,B461,4,J
2,142,BAe,BAE Systems 146-200 Passenger,146,4J,B462,4,J
3,143,BAe,146-300,146,4J,B463,4,J
4,146,BAe,146,NaN,NaN,NaN,NaN,NaN
5,14F,BAe,146 Freighter (-100/200/300QT & QC),NaN,NaN,NaN,NaN,NaN
6,14X,BAe,146 Freighter (-100QT & QC),14F,4J,B461,4,J
7,14Y,BAe,146 Freighter (-200QT & QC),14F,4J,B462,4,J
8,14Z,BAe,146 Freighter (-300QT & QC),14F,4J,B463,4,J
9,19D,Airbus,A319,NaN,NaN,NaN,NaN,NaN

In [147]:
aircraftdf.tail(5)

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
452,YK2,Yakovlev / Jakovlev,Yak 42,YK2,3J,YK42,3,J
453,YK4,Yakovlev / Jakovlev,Yak 40,YK4,3J,YK40,3,J
454,YN2,HAMC / Harbin,Y12,YN2,2T,Y12,2,T
455,YN7,Xian,Yunshuji Y7,YN7,2T,AN24,2,T
456,YS1,NAMC,YS-11,YS1,2T,YS11,2,T

In [148]:
len(aircraftdf)

457

In [149]:
aircraftdf.describe()

       nb_engines
count  343.000000
mean     2.408163
std      0.842679
min      1.000000
25%      2.000000
50%      2.000000
75%      3.000000
max      6.000000

In [150]:
aircraftdf.sum()

nb_engines    826
dtype: float64

In [152]:
aircraftdf.columns

Index([u'iata_code', u'manufacturer', u'model', u'iata_group',
       u'iata_category', u'icao_code', u'nb_engines', u'aircraft_type'],
      dtype='object')

In [153]:
# Ordenar en función de una columna

aircraftdf.sort('manufacturer')

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
173,AT4,ATR,ATR 42-300 / 320,ATR,2T,AT43,2,T
174,AT5,ATR,ATR 42-500,ATR,2T,AT45,2,T
175,AT7,ATR,ATR 72,ATR,2T,AT72,2,T
176,ATD,ATR,ATR 42-400,ATR,2T,AT44,2,T
177,ATF,ATR,ATR 72 Freighter,ATF,2T,AT72,2,T
179,ATR,ATR,ATR 42 / ATR 72,NaN,NaN,NaN,NaN,NaN
180,ATZ,ATR,ATR 42 Freighter,ATZ,2T,*,2,T
411,NDC,Aerospatiale / SNIAS,SN.601 Corvette,NDC,2J,S601,2,J
435,SSC,Aerospatiale / SNIAS,Concorde,NaN,NaN,NaN,NaN,NaN
159,AGH,Agusta / AgustaWestland,A-109,AGH,H,A109,NaN,H
181,AWH,AgustaWestland,AW139,AWH,2T,A139,2,T
9,19D,Airbus,A319,NaN,NaN,NaN,NaN,NaN
10,310,Airbus,A310,NaN,NaN,NaN,NaN,NaN
11,312,Airbus,A310-200,310,2J,A310,2,J
12,313,Airbus,A310-300,310,2J,A310,2,J
13,318,Airbus,A318,32S,2J,A318,2,J
14,319,Airbus,A319,32S,2J,A319,2,J
15,31F,Airbus,A310F,NaN,NaN,NaN,NaN,NaN
16,31W,Airbus,A319 (Sharklets),NaN,NaN,NaN,NaN,NaN
17,31X,Airbus,A310-200F,31F,2J,A310,2,J
18,31Y,Airbus,A310-300F,31F,2J,A310,2,J
19,320,Airbus,A320-100/200,32S,2J,A320,2,J
20,321,Airbus,A321-100/200,32S,2J,A321,2,J
21,32A,Airbus,A320 (sharklets),32S,2J,A320,2,J
22,32B,Airbus,A321 (sharklets),32S,2J,A321,2,J
23,32C,Airbus,A318 (sharklets),NaN,NaN,NaN,NaN,NaN
24,32D,Airbus,A319 (sharklets),NaN,NaN,NaN,NaN,NaN
25,32F,Airbus,A320 Freighter,32F,2J,A320,2,J
26,32X,Airbus,A321 Freighter,32X,2J,A321,2,J
27,330,Airbus,A330,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
431,SH3,Shorts,SD.330,SH3,2T,SH33,2,T
432,SH6,Shorts,SD.360,SH6,2T,SH36,2,T
433,SHB,Shorts,SC-5 Belfast,NaN,NaN,NaN,NaN,NaN
434,SHS,Shorts,SC-7 Skyvan,SHS,2T,SC7,2,T
425,S58,Sikorsky,S-58T,S58,H,S58T,NaN,H
426,S61,Sikorsky,S-61,S61,H,S61,NaN,H
427,S76,Sikorsky,S-76,S76,H,S76,NaN,H
233,CRV,Sud-Est,SE.210 Caravelle,NaN,NaN,NaN,NaN,NaN
436,SU1,Sukhoi,Superjet 100,NaN,NaN,NaN,NaN,NaN
437,SU7,Sukhoi,Superjet 100-75,SU1,2J,ZZZZ,2,J
438,SU9,Sukhoi,Superjet 100-95,SU1,2J,SU95,2,J
202,BUS,Surface Equipment,Bus,BUS,S,0000,NaN,S
383,LCH,Surface Equipment,Launch/Boat,LCH,S,0000,NaN,S
385,LMO,Surface Equipment,Limousine,LMO,S,0000,NaN,S
446,TRN,Surface Equipment,Train,TRN,S,0000,NaN,S
442,T20,Tupolev,Tu-204 / Tu-214,T20,2J,T204,2,J
443,T2F,Tupolev,Tu-204 Freighter,T2F,2J,T204,2,J
444,T34,Tupolev,Tu-334,T34,2J,T334,2,J
447,TU3,Tupolev,Tu-134,TU3,2J,T134,2,J
448,TU5,Tupolev,Tu-154,TU5,3J,T154,3,J
449,VCV,Vickers,Viscount,NaN,NaN,NaN,NaN,NaN
450,VCX,Vickers,VC-10,NaN,NaN,NaN,NaN,NaN
405,MA6,Xian,MA-60,MA6,2T,AN24,2,T
455,YN7,Xian,Yunshuji Y7,YN7,2T,AN24,2,T
452,YK2,Yakovlev / Jakovlev,Yak 42,YK2,3J,YK42,3,J
453,YK4,Yakovlev / Jakovlev,Yak 40,YK4,3J,YK40,3,J
201,BTA,NaN,Business Turbo-Prop Aircraft,BTA,2T,ZZZZ,2,T
358,HOV,NaN,Surface Equipment-Hovercraft,HOV,S,0000,NaN,S
384,LJA,NaN,Light Jet Aircraft,LJA,2J,ZZZZ,2,J
423,RFS,NaN,Surface Equipment-Road Feeder Service (Truck),RFS,S,0000,NaN,S

In [154]:
aircraftdf.sort('nb_engines')

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
415,PA1,Piper,Piper single piston engine,PAG,1P,*,1,P
343,GA8,GippsAero,GA8 Airvan,GA8,1P,GA8,1,P
217,CN1,Cessna,Cessna single piston engine,CNA,1P,*,1,P
309,DHL,De Havilland Canada,DHC-3 Turbo Otter,DHO,1T,DH3T,1,T
311,DHP,De Havilland Canada,DHC-2 Beaver,DHB,1P,DHC2,1,P
312,DHR,De Havilland Canada,DHC-2 Turbo-Beaver,DHB,1T,DH2T,1,T
357,HEC,Helio,H-250 Courier / H-295 / 385 Super Courie,HEC,1P,COUR,1,P
313,DHS,De Havilland Canada,DHC-3 Otter,DHO,1P,DHC3,1,P
420,PL6,Pilatus,PC-6 Turbo Porter,PL6,1T,PC6T,1,T
445,TBM,DAHER-SOCATA,TBM-700,TBM,1T,TBM7,1,T
195,BEP,Beechcraft,Beech singe piston,BEC,1P,*,1,P
419,PL2,Pilatus,PC-12,PL2,1T,PC12,1,T
221,CNC,Cessna,Cessna single turboprop engine,CNA,1T,*,1,T
279,D94,Douglas,DC-9-40,DC9,2J,DC94,2,J
280,D95,Douglas,DC-9-50,DC9,2J,DC95,2,J
282,D9D,Douglas,DC-9-40 Freighter,D9F,2J,DC94,2,J
281,D9C,Douglas,DC-9-30 Freighter,D9F,2J,DC93,2,J
0,100,Fokker,100,100,2J,F100,2,J
277,D92,Douglas,DC-9-20,DC9,2J,DC92,2,J
285,D9X,Douglas,DC-9-10 Freighter,D9F,2J,DC91,2,J
262,D4X,De Havilland Canada-Bombardier,DHC-8-400 Dash 8Q Freighter,DHF,2T,DH8D,2,T
261,D42,Diamond Aircraft,DA42 Twin Star,D42,2P,DA42,2,P
260,D3F,Douglas,DC-3 Freighter,D3F,2P,DC3,2,P
259,D38,Dornier,Do 328,D38,2T,D328,2,T
278,D93,Douglas,DC-9-30,DC9,2J,DC93,2,J
276,D91,Douglas,DC-9-10,DC9,2J,DC91,2,J
298,DH1,De Havilland Canada-Bombardier,DHC-8-100 Dash 8 / 8Q,DH8,2T,DH8A,2,T
291,DF1,Dassault,Falcon 10/100,DFL,2J,FA10,2,J
292,DF2,Dassault,Falcon 10 / 100 / 20 / 200 / 2000,DFL,2J,FA20,2,J
258,D2L,Dassault,Falcon 2000EX/EASY/LX,DFL,2J,F2TH,2,J
...,...,...,...,...,...,...,...,...
358,HOV,NaN,Surface Equipment-Hovercraft,HOV,S,0000,NaN,S
361,I93,Ilyushin,IL-96-300,NaN,NaN,NaN,NaN,NaN
363,I9M,Ilyushin,IL-96M,NaN,NaN,NaN,NaN,NaN
364,I9X,Ilyushin,IL-96-300 Freighter,NaN,NaN,NaN,NaN,NaN
365,I9Y,Ilyushin,IL-96T Freighter,NaN,NaN,NaN,NaN,NaN
374,JST,BAe,Jetstream 31 / 32 / 41,NaN,NaN,NaN,NaN,NaN
376,L10,Lockheed,L-1011 Tristar,NaN,NaN,NaN,NaN,NaN
380,L49,Lockheed,L-1049 Super Constellation,NaN,NaN,NaN,NaN,NaN
383,LCH,Surface Equipment,Launch/Boat,LCH,S,0000,NaN,S
385,LMO,Surface Equipment,Limousine,LMO,S,0000,NaN,S
389,LOM,Lockheed,L-188 Electra Mixed,NaN,NaN,NaN,NaN,NaN
396,M80,McDonnell Douglas,MD-80,NaN,NaN,NaN,NaN,NaN
404,M95,McDonnell Douglas,MD-95,NaN,NaN,NaN,NaN,NaN
406,MBH,MBB,Bo 105,MBH,H,B105,NaN,H
407,MD9,MD Helicopters,MD900 Explorer,MD9,H,EXPL,NaN,H
408,MIH,Mil,Mi-8 / Mi-17 / Mi-171 / Mil-172,MIH,H,MI8,NaN,H
410,ND2,Nord / SNCAN,N.262,NaN,NaN,NaN,NaN,NaN
412,NDE,Eurocopter,AS350 Ecureuil / AS355 Ecureuil 2,NDE,H,*,NaN,H
413,NDH,Eurocopter,SA365C / SA365N Dauphin 2,NDH,H,*,NaN,H
417,PAG,Piper,Piper light aircraft,NaN,NaN,NaN,NaN,NaN
423,RFS,NaN,Surface Equipment-Road Feeder Service (Truck),RFS,S,0000,NaN,S
425,S58,Sikorsky,S-58T,S58,H,S58T,NaN,H
426,S61,Sikorsky,S-61,S61,H,S61,NaN,H
427,S76,Sikorsky,S-76,S76,H,S76,NaN,H
433,SHB,Shorts,SC-5 Belfast,NaN,NaN,NaN,NaN,NaN
435,SSC,Aerospatiale / SNIAS,Concorde,NaN,NaN,NaN,NaN,NaN
436,SU1,Sukhoi,Superjet 100,NaN,NaN,NaN,NaN,NaN
446,TRN,Surface Equipment,Train,TRN,S,0000,NaN,S
449,VCV,Vickers,Viscount,NaN,NaN,NaN,NaN,NaN
450,VCX,Vickers,VC-10,NaN,NaN,NaN,NaN,NaN

In [155]:
aircraftdf.sort('manufacturer', ascending = False).head(5)

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
452,YK2,Yakovlev / Jakovlev,Yak 42,YK2,3J,YK42,3,J
453,YK4,Yakovlev / Jakovlev,Yak 40,YK4,3J,YK40,3,J
405,MA6,Xian,MA-60,MA6,2T,AN24,2,T
455,YN7,Xian,Yunshuji Y7,YN7,2T,AN24,2,T
449,VCV,Vickers,Viscount,NaN,NaN,NaN,NaN,NaN

In [156]:
aircraftdf.sort('manufacturer', ascending = True).head(5)

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
173,AT4,ATR,ATR 42-300 / 320,ATR,2T,AT43,2,T
174,AT5,ATR,ATR 42-500,ATR,2T,AT45,2,T
175,AT7,ATR,ATR 72,ATR,2T,AT72,2,T
176,ATD,ATR,ATR 42-400,ATR,2T,AT44,2,T
177,ATF,ATR,ATR 72 Freighter,ATF,2T,AT72,2,T

In [157]:
aircraftdf.sort('nb_engines', ascending = False).head(5)

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
145,A5F,Antonov,An-225,A5F,6J,A225,6,J
89,742,Boeing,747-200,747,4J,B742,4,J
106,74V,Boeing,747SR Freighter,74F,4J,B74R,4,J
94,74C,Boeing,747-200 Combi,74M,4J,B742,4,J
368,IL8,Ilyushin,IL-18,IL8,4T,IL18,4,T

In [158]:
aircraftdf.sort('nb_engines', ascending = True).head(5)

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
415,PA1,Piper,Piper single piston engine,PAG,1P,*,1,P
343,GA8,GippsAero,GA8 Airvan,GA8,1P,GA8,1,P
217,CN1,Cessna,Cessna single piston engine,CNA,1P,*,1,P
309,DHL,De Havilland Canada,DHC-3 Turbo Otter,DHO,1T,DH3T,1,T
311,DHP,De Havilland Canada,DHC-2 Beaver,DHB,1P,DHC2,1,P

In [159]:
# Ordenamiento de mayor a menor

dataframe2.rank()

   Columna1  Columna2  Columna3
0         1         1         1
1         2         2         2
2         3         3         3
3         4         4         4
4         5         5         5
5         6         6         6
6         7         7         7
7         8         8         8

In [160]:
# Podemos seleccionar el método del rank().
# Rank nos dará la posición del valor dentro del rango total en la serie.Sólo para números.Para texto lo hace alfabética.
dataframe2.rank(method='first')

   Columna1  Columna2  Columna3
0         1         1         1
1         2         2         2
2         3         3         3
3         4         4         4
4         5         5         5
5         6         6         6
6         7         7         7
7         8         8         8

In [161]:
# Para guardar el dataframe.

aircraftdf.to_csv("/home/dsc/Data/opentraveldata/salida.csv")

In [162]:
# con to_xls te lo guarda como excel. Pero necesitamos una librería antes: xlwt y xlrd (escritura y lectura)

import xlwt
import xlrd

In [164]:
aircraftdf.to_excel("/home/dsc/Data/opentraveldata/salida.xls")

In [165]:
# Guardamos ahora como diccionario.

minidf = aircraftdf.head()

In [166]:
minidf

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
0,100,Fokker,100,100,2J,F100,2,J
1,141,BAe,146-100,146,4J,B461,4,J
2,142,BAe,BAE Systems 146-200 Passenger,146,4J,B462,4,J
3,143,BAe,146-300,146,4J,B463,4,J
4,146,BAe,146,NaN,NaN,NaN,NaN,NaN

In [167]:
# Guardamos ahora como diccionario.
minidf.to_dict()

{'aircraft_type': {0: 'J', 1: 'J', 2: 'J', 3: 'J', 4: nan},
 'iata_category': {0: '2J', 1: '4J', 2: '4J', 3: '4J', 4: nan},
 'iata_code': {0: '100', 1: '141', 2: '142', 3: '143', 4: '146'},
 'iata_group': {0: '100', 1: '146', 2: '146', 3: '146', 4: nan},
 'icao_code': {0: 'F100', 1: 'B461', 2: 'B462', 3: 'B463', 4: nan},
 'manufacturer': {0: 'Fokker', 1: 'BAe', 2: 'BAe', 3: 'BAe', 4: 'BAe'},
 'model': {0: '100',
  1: '146-100',
  2: 'BAE Systems 146-200 Passenger',
  3: '146-300',
  4: '146'},
 'nb_engines': {0: 2.0, 1: 4.0, 2: 4.0, 3: 4.0, 4: nan}}

In [168]:
# hace estilo json, pero no lo es, es un diccionario.

minidf.to_dict(orient='records')

[{'aircraft_type': 'J',
  'iata_category': '2J',
  'iata_code': '100',
  'iata_group': '100',
  'icao_code': 'F100',
  'manufacturer': 'Fokker',
  'model': '100',
  'nb_engines': 2.0},
 {'aircraft_type': 'J',
  'iata_category': '4J',
  'iata_code': '141',
  'iata_group': '146',
  'icao_code': 'B461',
  'manufacturer': 'BAe',
  'model': '146-100',
  'nb_engines': 4.0},
 {'aircraft_type': 'J',
  'iata_category': '4J',
  'iata_code': '142',
  'iata_group': '146',
  'icao_code': 'B462',
  'manufacturer': 'BAe',
  'model': 'BAE Systems 146-200 Passenger',
  'nb_engines': 4.0},
 {'aircraft_type': 'J',
  'iata_category': '4J',
  'iata_code': '143',
  'iata_group': '146',
  'icao_code': 'B463',
  'manufacturer': 'BAe',
  'model': '146-300',
  'nb_engines': 4.0},
 {'aircraft_type': nan,
  'iata_category': nan,
  'iata_code': '146',
  'iata_group': nan,
  'icao_code': nan,
  'manufacturer': 'BAe',
  'model': '146',
  'nb_engines': nan}]

In [169]:
# directamente a JSON. Es una cadena de texto.

minidf.to_json()

'{"iata_code":{"0":"100","1":"141","2":"142","3":"143","4":"146"},"manufacturer":{"0":"Fokker","1":"BAe","2":"BAe","3":"BAe","4":"BAe"},"model":{"0":"100","1":"146-100","2":"BAE Systems 146-200 Passenger","3":"146-300","4":"146"},"iata_group":{"0":"100","1":"146","2":"146","3":"146","4":null},"iata_category":{"0":"2J","1":"4J","2":"4J","3":"4J","4":null},"icao_code":{"0":"F100","1":"B461","2":"B462","3":"B463","4":null},"nb_engines":{"0":2.0,"1":4.0,"2":4.0,"3":4.0,"4":null},"aircraft_type":{"0":"J","1":"J","2":"J","3":"J","4":null}}'

In [171]:
minidf.to_json(orient='records')

'[{"iata_code":"100","manufacturer":"Fokker","model":"100","iata_group":"100","iata_category":"2J","icao_code":"F100","nb_engines":2.0,"aircraft_type":"J"},{"iata_code":"141","manufacturer":"BAe","model":"146-100","iata_group":"146","iata_category":"4J","icao_code":"B461","nb_engines":4.0,"aircraft_type":"J"},{"iata_code":"142","manufacturer":"BAe","model":"BAE Systems 146-200 Passenger","iata_group":"146","iata_category":"4J","icao_code":"B462","nb_engines":4.0,"aircraft_type":"J"},{"iata_code":"143","manufacturer":"BAe","model":"146-300","iata_group":"146","iata_category":"4J","icao_code":"B463","nb_engines":4.0,"aircraft_type":"J"},{"iata_code":"146","manufacturer":"BAe","model":"146","iata_group":null,"iata_category":null,"icao_code":null,"nb_engines":null,"aircraft_type":null}]'

## Creación de datos Fake

In [172]:
# Creación de datos aleatorios con range

fake = DataFrame({'col1':range(0,1000)})

In [193]:
# Creación con Rand
fake = DataFrame(np.random.randn(1000,1))

In [194]:
fake

            0
0   -1.935807
1   -0.294151
2    1.793077
3   -0.028147
4   -1.223323
5    0.947627
6    0.155588
7    0.088281
8    0.137750
9    0.192868
10  -0.852700
11   2.161558
12   0.363750
13  -0.308264
14   1.496304
15   0.262156
16  -0.089341
17   0.103469
18  -0.628642
19   1.602237
20   2.151599
21   1.396464
22  -0.870411
23  -0.213115
24   0.228831
25   1.484511
26  -0.013226
27   0.113403
28   1.032998
29   0.634398
..        ...
970 -1.320829
971 -0.961835
972 -0.556424
973  0.106633
974 -0.375471
975 -0.937814
976  1.631683
977 -0.112485
978  1.033264
979 -0.184471
980  0.707481
981 -1.164134
982  0.012303
983  0.701800
984 -0.027642
985  0.043974
986  0.783763
987 -0.906436
988  1.235756
989 -0.762457
990 -0.171371
991 -0.387923
992 -0.294040
993 -0.592895
994  0.689443
995  0.750938
996  0.856086
997  1.602224
998 -1.028680
999 -0.796615

[1000 rows x 1 columns]

In [195]:
fake.columns = ['Population']

In [196]:
fake.head()

   Population
0   -1.935807
1   -0.294151
2    1.793077
3   -0.028147
4   -1.223323

In [197]:
fake['Population']=fake.apply(lambda row: int(abs(100*row[0])), axis=1)

In [198]:
fake

     Population
0           193
1            29
2           179
3             2
4           122
5            94
6            15
7             8
8            13
9            19
10           85
11          216
12           36
13           30
14          149
15           26
16            8
17           10
18           62
19          160
20          215
21          139
22           87
23           21
24           22
25          148
26            1
27           11
28          103
29           63
..          ...
970         132
971          96
972          55
973          10
974          37
975          93
976         163
977          11
978         103
979          18
980          70
981         116
982           1
983          70
984           2
985           4
986          78
987          90
988         123
989          76
990          17
991          38
992          29
993          59
994          68
995          75
996          85
997         160
998         102
999          79

[1000 rows x 1 columns]

In [199]:
pwd

u'/home/dsc/Master/clase 11-12'